In [1]:
from sqlalchemy import create_engine
import pandas as pd
import geopandas as gpd
import seaborn as sns
from matplotlib import pyplot as plt
import folium
from folium.plugins import MarkerCluster
from folium.plugins import FastMarkerCluster

In [2]:
import sys
'geopandas' in sys.modules

True

In [3]:
database_name = 'scooters'
connection_string= f'postgresql://postgres:postgres@localhost:5432/{database_name}'
engine = create_engine(connection_string)

#### EDA

In [5]:
##Example provided in class to see if it runs, but also provides the names of each company
query= '''
SELECT companyname, SUM(tripduration)
FROM trips
WHERE tripduration IS NOT NULL
GROUP BY companyname
'''

test=pd.read_sql(query, con= engine)
test

     companyname           sum
0           Bird  2.046202e+06
1  Bolt Mobility  3.082150e+07
2         Gotcha  3.380278e+04
3           JUMP  2.110013e+05
4           Lime  3.507335e+06
5           Lyft  1.936370e+06
6           SPIN  9.005750e+05

Company names: BIrd, Bolt Mobility, Gotcha, JUMP, Lime, Lyft, SPIN

In [6]:
query= '''
SELECT
    sum(case when pubtimestamp is null then 1 else 0 end) as pubtimestamp, 
    sum(case when companyname is null then 1 else 0 end) as companyname, 
    sum(case when triprecordnum is null then 1 else 0 end) as triprecordnum,
    sum(case when sumdid is null then 1 else 0 end) as sumdid, 
    sum(case when tripduration is null then 1 else 0 end) as tripduration, 
    sum(case when tripduration is null then 1 else 0 end) as tripdistance,
    sum(case when startdate is null then 1 else 0 end) as startdate,
    sum(case when starttime is null then 1 else 0 end) as starttime,
    sum(case when enddate is null then 1 else 0 end) as enddate, 
    sum(case when endtime is null then 1 else 0 end) as endtime, 
    sum(case when startlatitude is null then 1 else 0 end) as startlatitude,
    sum(case when startlongitude is null then 1 else 0 end) as startlongitude,
    sum(case when endlatitude is null then 1 else 0 end) as endlatitude, 
    sum(case when endlongitude is null then 1 else 0 end) as endlongitude, 
    sum(case when triproute is null then 1 else 0 end) as triproute,
    sum(case when create_dt is null then 1 else 0 end) as create_dt 
FROM trips 
'''

trips_null=pd.read_sql(query, con= engine)
trips_null

# no null values in trips table

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0

In [7]:
query= '''
SELECT
    sum(case when pubdatetime is null then 1 else 0 end) as pubdatetime, 
    sum(case when latitude is null then 1 else 0 end) as latitude, 
    sum(case when longitude is null then 1 else 0 end) as longitude,
    sum(case when sumdid is null then 1 else 0 end) as sumdid, 
    sum(case when sumdtype is null then 1 else 0 end) as sumdtype, 
    sum(case when chargelevel is null then 1 else 0 end) as chargelevel,
    sum(case when sumdgroup is null then 1 else 0 end) as sumdgroup,
    sum(case when costpermin is null then 1 else 0 end) as costpermin, 
    sum(case when companyname is null then 1 else 0 end) as companyname
FROM scooters
'''

scooters_null=pd.read_sql(query, con= engine)
scooters_null
# 770 null values shown in chargelevel, does not seem like it will be needed for deliverables . . .

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,0,0,0,0,0,770,0,0,0

In [ ]:
query= '''
SELECT MAX(DISTINCT pubdatetime), MIN(DISTINCT pubdatetime)
FROM scooters
'''
scooters_pubdatetime_max_min= pd.read_sql(query, con=engine)
scooters_pubdatetime_max_min
# 2019-07-31 23:59:57	2019-05-01 00:01:41.247
#May 1st - July 31st

In [ ]:
query= '''
SELECT MAX(DISTINCT pubtimestamp),MIN(DISTINCT pubtimestamp)
FROM trips
'''
trips_pubtimestamp_max_min=pd.read_sql(query, con=engine)
trips_pubtimestamp_max_min
#2019-08-01 07:04:00	2019-05-01 00:00:55.423
#May 1st - August 1st

In [ ]:
query= '''
SELECT MAX(DISTINCT startdate), MIN(DISTINCT startdate)
FROM trips
'''
trips_startdate_max_min=pd.read_sql(query, con=engine)
trips_startdate_max_min
# 2019-07-31	2019-05-01
# May 1st - July 31st

In [ ]:
query= '''
SELECT MAX(DISTINCT enddate), MIN(DISTINCT enddate)
FROM trips
'''
trips_enddate_max_min=pd.read_sql(query, con=engine)
trips_enddate_max_min
# 2019-08-01	2019-05-01
#May 1st - August 1st

In [ ]:
query= '''
SELECT MAX(DISTINCT create_dt), MIN(DISTINCT create_dt)
FROM trips
'''
trips_create_dt_max_min=pd.read_sql(query, con=engine)
trips_create_dt_max_min
# 2019-08-02 11:30:29.923	2019-05-02 05:30:23.780
#May 2nd - August 2nd

In [ ]:
query= '''
SELECT pubtimestamp
FROM trips
'''
trips_pubtimestamp_val= pd.read_sql(query, con=engine)
trips_pubtimestamp_val["pubtimestamp"].dt.month.value_counts()

In [ ]:
query= '''
SELECT pubdatetime
FROM scooters
'''
scooters_pubtimestamp_val= pd.read_sql(query, con=engine)
scooters_pubtimestamp_val["pubdatetime"].dt.month.value_counts()

In [ ]:
trips_pubtimestamp_val["pubtimestamp"].dt.day.value_counts()

In [ ]:
query= '''
SELECT DISTINCT sumdgroup
FROM scooters
'''
scooters_sumdgroup=pd.read_sql(query, con=engine)
scooters_sumdgroup
#sumdgroup shows there are 2 scooter groups due to casing, and a bicycle category. Bicycle will need to be excluded

three sumdgroups: 2 scooters categories due to casing issue, and 1 bicycle category

In [ ]:
query= '''
SELECT MAX(DISTINCT startlatitude), MIN(DISTINCT startlatitude)
FROM trips
'''
trips_startlatitude_max_min=pd.read_sql(query, con=engine)
trips_startlatitude_max_min
# 36.300029 	 35.8532

In [ ]:
query= '''
SELECT MAX(DISTINCT startlongitude), MIN(DISTINCT startlongitude)
FROM trips
'''
trips_startlongitude_max_min=pd.read_sql(query, con=engine)
trips_startlongitude_max_min
# -86.3662 	 -86.918008

In [ ]:
query= '''
SELECT MAX(DISTINCT endlatitude), MIN(DISTINCT endlatitude)
FROM trips
'''
trips_endlatitude_max_min=pd.read_sql(query, con=engine)
trips_endlatitude_max_min
# 51.045409 	 -36.850405

In [ ]:
query= '''
SELECT MAX(DISTINCT endlongitude), MIN(DISTINCT endlongitude)
FROM trips
'''
trips_endlongitude_max_min=pd.read_sql(query, con=engine)
trips_endlongitude_max_min
# 174.764886	-122.673729

In [ ]:
query= '''
SELECT MAX(DISTINCT latitude), MIN(DISTINCT latitude)
FROM scooters
'''
scooters_latitude_max_min=pd.read_sql(query, con=engine)
scooters_latitude_max_min
# 3.609874e+06	 0.0

In [ ]:
query= '''
SELECT MAX(DISTINCT longitude), MIN(DISTINCT longitude)
FROM scooters
'''
scooters_longitude_max_min=pd.read_sql(query, con=engine)
scooters_longitude_max_min
# 0.0	 -97.443879

nashville's coordinates (google search): 	36.174465 , -86.767960 so would expect coordinates to be centered around these numbers, however some do not follow this

In [ ]:
query= '''
SELECT MAX(DISTINCT tripduration), MIN(DISTINCT tripduration)
FROM trips
'''
trips_duration_max_min=pd.read_sql(query, con=engine)
trips_duration_max_min

In [ ]:
query= '''
SELECT companyname, AVG(tripduration) AS avg_min
FROM trips
GROUP BY companyname
'''
trips_duration_avg=pd.read_sql(query, con=engine)
trips_duration_avg

In [ ]:
query= '''
SELECT companyname, SUM(tripduration)
FROM trips
GROUP BY companyname
'''

trips_duration_company=pd.read_sql(query, con= engine)
trips_duration_company

In [ ]:
query= '''
SELECT tripduration
FROM trips
'''
trips_duration=pd.read_sql(query, con=engine)
trips_duration

In [ ]:
trips_duration.plot()

In [ ]:
query= '''
SELECT tripdistance
FROM trips
'''
trips_distance=pd.read_sql(query, con=engine)
trips_distance.plot()

In [ ]:
query= '''
SELECT MAX(DISTINCT tripdistance), MIN(DISTINCT tripdistance)
FROM trips
'''
trip_dis=pd.read_sql(query, con=engine)
trip_dis

In [ ]:
query= '''
SELECT companyname, AVG(tripdistance) AS avg_ft
FROM trips
GROUP BY companyname
'''
trips_distance_avg=pd.read_sql(query, con=engine)
trips_distance_avg

In [ ]:
query= '''
SELECT companyname, COUNT( DISTINCT sumdid)
FROM scooters
WHERE sumdgroup <> 'bicycle'
GROUP BY companyname
ORDER BY COUNT( DISTINCT sumdid) DESC;
'''

scooters_number_per_co=pd.read_sql(query, con= engine)
scooters_number_per_co
#amount of scooters per company over the 3 months

### Number 1 input

In [ ]:
SELECT pubdatetime, sumdid, companyname
FROM trips 
WHERE tripduration AND tripdistance

### Number 3 and 4 attempt:

3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

In [ ]:
query= '''
SELECT DISTINCT sumdid, startdate, companyname, tripduration, tripdistance
FROM trips 
WHERE tripduration BETWEEN 1 and 1440
'''

trips_per_sumdid=pd.read_sql(query, con= engine)
trips_per_sumdid

In [4]:
bus = pd.read_csv('../data/bus.csv')

In [ ]:
bus.head()